Tekla Open API Reference for Tekla Structures 2025
ReinforcementBase.ReinforcementBaseAttributes.ReinforcementRepresentation Property
 The representation of reinforcing bars.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ReinforcementBase.ReinforcementRepresentationTypes ReinforcementRepresentation { get; set; }
Public Property ReinforcementRepresentation As ReinforcementBase.ReinforcementRepresentationTypes
	Get
	Set
Property Value
Type: ReinforcementBase.ReinforcementRepresentationTypes
See Also
Reference
ReinforcementBase.ReinforcementBaseAttributes Class
Tekla.Structures.Drawing Namespace